print("Hello world!") # print() - це спеціальна функція для того, щоб виводити якусь інформацію в консоль

#* створення змінних. Для створення потрібно придумати назву (назва повинна відображати сенс того, що ви будете зберігати у змінній + змінні повинні називатись англійською мовою, без використання таких символів(*, &, -, +, =, #, @, ! і тд))

first_number = 10
second_number = 5
# тут я створив дві змінні з назвами first_number і second_number, а також відразу зберіг в них значення 10 і 5 за допомогою оператора присвоєння (=)

print(first_number)
print(second_number)


#* Коментар - це частина коду яка не буде виконуватись (може використовуватись для того щоб підписати якийсь код і щоб цей текст не виконувався)
# Коментарі бувають двох типів:
# 1. Однорядковий: коментар який займає один рядок, пишеться за допомогою символа #
# 2. Багаторядковий: коментра, який займає багато рядків, пишеться за допомогою символів '''

'''
я
багаторядковий
коментра
'''

#! Математичні оператори

print(5 + 10) # + оператор додавання
print(10 - 5) # - оператор віднімання
print(5 * 2) # * оператор множення
print(10 / 2) # / оператор ділення
print(5 ** 3) # ** оператор возведення в степінь (5**3 - означає 5 у 3й степені, тобто це 5 * 5 * 5 = 125)
print(5 % 3) # % оператор остачі від ділення, він повертає остачу від ділення одного числа на інше (5 % 3 -> беремо найближче число до 5, яке ділиться націло на 3, це 3 -> ми від 5 - 3 = 2. Значить остача від ділення = 2)
print(14 % 5) # 14 % 5 -> беремо найближче число до 14, яке ділиться націло на 5, це число 10 -> від 14 - 10 = 4. Остача від ділення 14 % 5 = 4
print(20 % 5) # 0
print(6 > 9) # оператор порівняння (завжди повертають або True(правда, або істина) або False(неправда, або хиба))
print(5 < 100) # True
print(5 >= 5) # одночасно перевіряє що 5 повинно бути більшим або рівним 5 
print(10 >= 5)  # True
print(5 >= 5) # True
print(5 > 5) # False
print(10 == 10) # == оператор порівняння, перевіряє чи рівне одне число іншому
print(10 == 100)
print(91 + 9 == 201 - 101) # 100 == 100 -> True

#! Типи даних

age = 15 # Integer(Int) - цілочисельний тип даних
user_height = 1.68 # Float - дробові числа (числа з плаваючою крапкою, тобто - не цілі)
name = "Oleg" # String - строки, в цьому типі зберігаються будь-які символи всередині лапок ("", '')
is_user_play_games = True # Boolean (Bool) - це логічний тип даних, він вміє зберігати тільки два значення: True або False.
user_city = None # NoneType - означає нічого, пустота або відсутність інформації.

# print("5" + 5) # "5" - це строка, а 5 - це число, і коли ми намагаємось додати число до строки - ми отримаємо помилку. Чому? Тому що в програмуванні неможливо робити операції з різними типами даних

#* type() - це функція яка повертає тип даних якогось значення. Часто використовується для перевірки типу даних

# print(type(True))
# print(type("False"))
# print(type(5.145))
# print(type(5))

#* input() - функція для того щоб запитати у користувача якусь інформацію, яку потім можна зберегти у змінну і використовувати у коді(ЗАВЖДИ ПОВЕРТАЄ СТРОКУ)

'''
Перетворення типів даних(ви можете перетворити один тип на інший, наприклад строку на число)

* int() - перетворює якесь значення на ціле число
* float() - перетворює якесь значення на дробове число
* str() - перетворює якесь значення на строку
* bool() - перетворює якесь значення на True або False

'''

print(int("50")) # "50"(string) -> 50(integer)
print(float("50.43")) #"50.43"(string) -> 50.43(float)
# print(int("hello")) # помилка! в число неможливо перетворити текст
# print(int("50.43")) # помилка! в ціле число неможливо перетворити дробове (можна округлити, але про це пізніше)
print(str(50)) # 50 -> "50"
print(bool(50)) # 50 -> True
print(bool(0)) # 0 -> False
print(bool("hello")) # "Hello" -> True
print(bool("")) # "" -> False
print(bool(" ")) # " " -> True

'''
True: будь-яке число, крім 0(і додатнє і відʼємне і дробове), будь-яка строка з символами

False: 0, пуста строка(""), None
'''

first_number = int(input("Введіть перше ціле число:"))
second_number = int(input("Введіть друге ціле число:"))

# "50" + "40" = "5040" - коли ви додаєте дві строки - вони склеюються і у вас в результаті все одно виходить строка

print("Результат додавання: ", first_number + second_number)
print("Результат віднімання: ", first_number - second_number)
print("Результат множення: ", first_number * second_number)
print("Результат ділення: ", first_number / second_number)
# print(type(first_number))